zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_generator_v3.h
/* CSW6 = CSDBUSC connection */
#define CY_CAPSENSE_SM_REG_SW_SEL_CSW6_VDDA2_VALUE \
((CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_SW_SNCA  << MSC_SW_SEL_CSW_SW_SNCA_Pos)  | \
 (CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_SW_SNCB  << MSC_SW_SEL_CSW_SW_SNCB_Pos)  | \
 (CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_SW_SNCC  << MSC_SW_SEL_CSW_SW_SNCC_Pos)  | \
 (CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_SW_SNCV  << MSC_SW_SEL_CSW_SW_SNCV_Pos)  | \
 (CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_SW_SNCG  << MSC_SW_SEL_CSW_SW_SNCG_Pos)  | \
 (CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_REF_MODE << MSC_SW_SEL_CSW_REF_MODE_Pos) | \
 (CY_CAPSENSE_SM_FULL_WAVE_CTRL_MUX_REG_SW_SEL_CSW6_FLD_ENABLED  << MSC_SW_SEL_CSW_ENABLED_Pos)) \

/* External Cref0 pin SW_SEL_CSW register value */
#define CY_CAPSENSE_EXT_CREF0_SW_SEL_CSW_VALUE \
((CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCA  << MSC_SW_SEL_CSW_SW_SNCA_Pos)  | \
 (CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCB  << MSC_SW_SEL_CSW_SW_SNCB_Pos)  | \
 (CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCC  << MSC_SW_SEL_CSW_SW_SNCC_Pos)  | \
 (CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCV  << MSC_SW_SEL_CSW_SW_SNCV_Pos)  | \
 (CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCG  << MSC_SW_SEL_CSW_SW_SNCG_Pos)  | \
 (CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_REF_MODE << MSC_SW_SEL_CSW_REF_MODE_Pos) | \
 (CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_ENABLED  << MSC_SW_SEL_CSW_ENABLED_Pos))

/* External Cref1 pin SW_SEL_CSW register value */
#define CY_CAPSENSE_EXT_CREF1_SW_SEL_CSW_VALUE \
((CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCA  << MSC_SW_SEL_CSW_SW_SNCA_Pos)  | \
 (CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCB  << MSC_SW_SEL_CSW_SW_SNCB_Pos)  | \
 (CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCC  << MSC_SW_SEL_CSW_SW_SNCC_Pos)  | \
 (CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCV  << MSC_SW_SEL_CSW_SW_SNCV_Pos)  | \
 (CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCG  << MSC_SW_SEL_CSW_SW_SNCG_Pos)  | \
 (CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_REF_MODE << MSC_SW_SEL_CSW_REF_MODE_Pos) | \
 (CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_ENABLED  << MSC_SW_SEL_CSW_ENABLED_Pos))

/* SW_SEL_CSW field values for External Cref0 pin */
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCA                    (0x00uL)
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCB                    (0x00uL)
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCC                    (0x00uL)
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCV                    (0x09uL)
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_SW_SNCG                    (0x0AuL)
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_REF_MODE                   (0x01uL)
#define CY_CAPSENSE_EXT_CREF0_REG_SW_SEL_CSW_FLD_ENABLED                    (0x01uL)

/* SW_SEL_CSW field values for External Cref1 pin */
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCA                    (0x09uL)
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCB                    (0x08uL)
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCC                    (0x00uL)
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCV                    (0x00uL)
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_SW_SNCG                    (0x00uL)
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_REF_MODE                   (0x01uL)
#define CY_CAPSENSE_EXT_CREF1_REG_SW_SEL_CSW_FLD_ENABLED                    (0x01uL)

/* CSD Regular Measurement */
#define CY_CAPSENSE_CSD_RM_SENSING_METHOD_INDEX         (0u)
/* CSX Regular Measurement */
#define CY_CAPSENSE_CSX_RM_SENSING_METHOD_INDEX         (1u)
/* CSD with Dithering */
#define CY_CAPSENSE_CSD_DITHERING_SENSING_METHOD_INDEX  (2u)
/* CSX with Dithering */
#define CY_CAPSENSE_CSX_DITHERING_SENSING_METHOD_INDEX  (3u)
/** Sensing mode undefined */
#define CY_CAPSENSE_REG_MODE_UNDEFINED                  (255u)
/** CSD sense mode configuration index */
#define CY_CAPSENSE_REG_MODE_CSD                        (0u)
/** CSX sense mode configuration index */
#define CY_CAPSENSE_REG_MODE_CSX                        (1u)
/** CSD sense mode configuration index with CapDAC dithering enabled */
#define CY_CAPSENSE_REG_MODE_CSD_DITHERING              (2u)
/** CSX sense mode configuration index with CapDAC dithering enabled */
#define CY_CAPSENSE_REG_MODE_CSX_DITHERING              (3u)
/** First mode index with CapDAC dithering enabled */
#define CY_CAPSENSE_REG_MODE_DITHERING                  (CY_CAPSENSE_REG_MODE_CSD_DITHERING)


/* Helper macros for swSelCswFunc template entries that depend on ext cref configuration */
#if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC4_INDEX     CY_CAPSENSE_CTRLMUX_PIN_STATE_TX_NEGATIVE
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC4_VALUE     (CY_CAPSENSE_SM_REG_SW_SEL_CSW2_NEG_TX_VALUE)
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC7_INDEX     CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC7_VALUE     (CY_CAPSENSE_SM_REG_SW_SEL_CSW6_VDDA2_VALUE)
#else
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC4_INDEX     CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF0
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC4_VALUE     (CY_CAPSENSE_EXT_CREF0_SW_SEL_CSW_VALUE)
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC7_INDEX     CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF1
    #define CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC7_VALUE     (CY_CAPSENSE_EXT_CREF1_SW_SEL_CSW_VALUE)
#endif


/** Initialization of sensing method template variable */
#define CY_CAPSENSE_SENSING_METHOD_BASE_TEMPLATE            \
    {                                                   \
        .ctl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_SENSE_EN << MSC_CTL_SENSE_EN_Pos)                    | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_MSCCMP_EN << MSC_CTL_MSCCMP_EN_Pos)                   | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_CLK_SYNC_EN << MSC_CTL_CLK_SYNC_EN_Pos)               | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_EXT_FRAME_START_EN << MSC_CTL_EXT_FRAME_START_EN_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_OPERATING_MODE << MSC_CTL_OPERATING_MODE_Pos)         | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_BUF_MODE << MSC_CTL_BUF_MODE_Pos)                     | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_CLK_MSC_RATIO << MSC_CTL_CLK_MSC_RATIO_Pos)           | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CTL_FLD_ENABLED << MSC_CTL_ENABLED_Pos)),                      \
        .spare = \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SPARE_FLD_SPARE), \
        .scanCtl1 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL1_FLD_NUM_AUTO_RESAMPLE << MSC_SCAN_CTL1_NUM_AUTO_RESAMPLE_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL1_FLD_RESCAN_DEBUG_MODE << MSC_SCAN_CTL1_RESCAN_DEBUG_MODE_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL1_FLD_NUM_SAMPLES << MSC_SCAN_CTL1_NUM_SAMPLES_Pos)              | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL1_FLD_RAW_COUNT_MODE << MSC_SCAN_CTL1_RAW_COUNT_MODE_Pos)        | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL1_FLD_DEBUG_CONV_PH_SEL << MSC_SCAN_CTL1_DEBUG_CONV_PH_SEL_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL1_FLD_FRAME_START_PTR << MSC_SCAN_CTL1_FRAME_START_PTR_Pos)),     \
        .scanCtl2 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL2_FLD_NUM_EPI_CYCLES << MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos)       | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL2_FLD_CHOP_POL << MSC_SCAN_CTL2_CHOP_POL_Pos)                    | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SCAN_CTL2_FLD_CHOP_EVEN_HOLD_EN << MSC_SCAN_CTL2_CHOP_EVEN_HOLD_EN_Pos)), \
        .initCtl1 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL1_FLD_NUM_INIT_CMOD_12_RAIL_CYCLES << MSC_INIT_CTL1_NUM_INIT_CMOD_12_RAIL_CYCLES_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL1_FLD_NUM_INIT_CMOD_12_SHORT_CYCLES << MSC_INIT_CTL1_NUM_INIT_CMOD_12_SHORT_CYCLES_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL1_FLD_PER_SAMPLE << MSC_INIT_CTL1_PER_SAMPLE_Pos)),                                      \
        .initCtl2 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL2_FLD_NUM_INIT_CMOD_34_RAIL_CYCLES << MSC_INIT_CTL2_NUM_INIT_CMOD_34_RAIL_CYCLES_Pos)   | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL2_FLD_NUM_INIT_CMOD_34_SHORT_CYCLES << MSC_INIT_CTL2_NUM_INIT_CMOD_34_SHORT_CYCLES_Pos)), \
        .initCtl3 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL3_FLD_NUM_PRO_OFFSET_CYCLES << MSC_INIT_CTL3_NUM_PRO_OFFSET_CYCLES_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL3_FLD_NUM_PRO_OFFSET_TRIPS << MSC_INIT_CTL3_NUM_PRO_OFFSET_TRIPS_Pos)    | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL3_FLD_CMOD_SEL << MSC_INIT_CTL3_CMOD_SEL_Pos)                            | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL3_FLD_INIT_MODE << MSC_INIT_CTL3_INIT_MODE_Pos)),                         \
        .initCtl4 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL4_FLD_NUM_PRO_DUMMY_SUB_CONVS << MSC_INIT_CTL4_NUM_PRO_DUMMY_SUB_CONVS_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INIT_CTL4_FLD_NUM_PRO_WAIT_CYCLES << MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Pos)), \
        .senseDutyCtl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH << MSC_SENSE_DUTY_CTL_PHASE_WIDTH_Pos)              | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SENSE_DUTY_CTL_FLD_PHASE_SHIFT_CYCLES << MSC_SENSE_DUTY_CTL_PHASE_SHIFT_CYCLES_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SENSE_DUTY_CTL_FLD_PHASE_WIDTH_SEL << MSC_SENSE_DUTY_CTL_PHASE_WIDTH_SEL_Pos)),      \
        .sensePeriodCtl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SENSE_PERIOD_CTL_FLD_LFSR_POLY << MSC_SENSE_PERIOD_CTL_LFSR_POLY_Pos)   | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SENSE_PERIOD_CTL_FLD_LFSR_SCALE << MSC_SENSE_PERIOD_CTL_LFSR_SCALE_Pos)), \
        .filterCtl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_FILTER_CTL_FLD_BIT_FORMAT << MSC_FILTER_CTL_BIT_FORMAT_Pos)   | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_FILTER_CTL_FLD_FILTER_MODE << MSC_FILTER_CTL_FILTER_MODE_Pos)), \
        .ccompCdacCtl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CCOMP_CDAC_CTL_FLD_SEL_CO_PRO_OFFSET << MSC_CCOMP_CDAC_CTL_SEL_CO_PRO_OFFSET_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CCOMP_CDAC_CTL_FLD_EPILOGUE_EN << MSC_CCOMP_CDAC_CTL_EPILOGUE_EN_Pos)),             \
        .ditherCdacCtl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_DITHER_CDAC_CTL_FLD_SEL_FL << MSC_DITHER_CDAC_CTL_SEL_FL_Pos)             | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_DITHER_CDAC_CTL_FLD_LFSR_POLY_FL << MSC_DITHER_CDAC_CTL_LFSR_POLY_FL_Pos)), \
        .cswCtl = \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_CSW_CTL_FLD_CSW_FUNC_MODE), \
        .swSelGpio = \
                    ((CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_CSD_SENSE   << MSC_SW_SEL_GPIO_SW_CSD_SENSE_Pos)     | \
                    (CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_CSD_SHIELD   << MSC_SW_SEL_GPIO_SW_CSD_SHIELD_Pos)    | \
                    (CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_CSD_MUTUAL   << MSC_SW_SEL_GPIO_SW_CSD_MUTUAL_Pos)    | \
                    (CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_CSD_POLARITY << MSC_SW_SEL_GPIO_SW_CSD_POLARITY_Pos)  | \
                    (CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_CSD_CHARGE   << MSC_SW_SEL_GPIO_SW_CSD_CHARGE_Pos)    | \
                    (CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_DSI_CMOD     << MSC_SW_SEL_GPIO_SW_DSI_CMOD_Pos)      | \
                    (CY_CAPSENSE_SM_CSX_FULL_WAVE_GPIO_REG_SW_SEL_GPIO_FLD_SW_DSI_CSH_TANK << MSC_SW_SEL_GPIO_SW_DSI_CSH_TANK_Pos)), \
        .swSelCdacRe = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_RE_FLD_SW_RETCA << MSC_SW_SEL_CDAC_RE_SW_RETCA_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_RE_FLD_SW_RECB   << MSC_SW_SEL_CDAC_RE_SW_RECB_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_RE_FLD_SW_RETV   << MSC_SW_SEL_CDAC_RE_SW_RETV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_RE_FLD_SW_RETG   << MSC_SW_SEL_CDAC_RE_SW_RETG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_RE_FLD_SW_REBV   << MSC_SW_SEL_CDAC_RE_SW_REBV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_RE_FLD_SW_REBG   << MSC_SW_SEL_CDAC_RE_SW_REBG_Pos)), \
        .swSelCdacCo = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CO_FLD_SW_COTCA << MSC_SW_SEL_CDAC_CO_SW_COTCA_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CO_FLD_SW_COCB   << MSC_SW_SEL_CDAC_CO_SW_COCB_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CO_FLD_SW_COTV   << MSC_SW_SEL_CDAC_CO_SW_COTV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CO_FLD_SW_COTG   << MSC_SW_SEL_CDAC_CO_SW_COTG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CO_FLD_SW_COBV   << MSC_SW_SEL_CDAC_CO_SW_COBV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CO_FLD_SW_COBG   << MSC_SW_SEL_CDAC_CO_SW_COBG_Pos)), \
        .swSelCdacCf = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CF_FLD_SW_CFTCA << MSC_SW_SEL_CDAC_CF_SW_CFTCA_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CF_FLD_SW_CFTCB  << MSC_SW_SEL_CDAC_CF_SW_CFTCB_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CF_FLD_SW_CFTV   << MSC_SW_SEL_CDAC_CF_SW_CFTV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CF_FLD_SW_CFTG   << MSC_SW_SEL_CDAC_CF_SW_CFTG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CF_FLD_SW_CFBV   << MSC_SW_SEL_CDAC_CF_SW_CFBV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CDAC_CF_FLD_SW_CFBG   << MSC_SW_SEL_CDAC_CF_SW_CFBG_Pos)), \
        .swSelCmod1 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_SW_C1CA << MSC_SW_SEL_CMOD1_SW_C1CA_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_SW_C1CB  << MSC_SW_SEL_CMOD1_SW_C1CB_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_SW_C1CC  << MSC_SW_SEL_CMOD1_SW_C1CC_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_SW_C1CV  << MSC_SW_SEL_CMOD1_SW_C1CV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_SW_C1CG  << MSC_SW_SEL_CMOD1_SW_C1CG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_REF_MODE << MSC_SW_SEL_CMOD1_REF_MODE_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD1_FLD_ENABLED  << MSC_SW_SEL_CMOD1_ENABLED_Pos)), \
        .swSelCmod2 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_SW_C2CA << MSC_SW_SEL_CMOD2_SW_C2CA_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_SW_C2CB  << MSC_SW_SEL_CMOD2_SW_C2CB_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_SW_C2CC  << MSC_SW_SEL_CMOD2_SW_C2CC_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_SW_C2CV  << MSC_SW_SEL_CMOD2_SW_C2CV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_SW_C2CG  << MSC_SW_SEL_CMOD2_SW_C2CG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_REF_MODE << MSC_SW_SEL_CMOD2_REF_MODE_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD2_FLD_ENABLED  << MSC_SW_SEL_CMOD2_ENABLED_Pos)), \
        .swSelCmod3 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_SW_C3CA << MSC_SW_SEL_CMOD3_SW_C3CA_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_SW_C3CB  << MSC_SW_SEL_CMOD3_SW_C3CB_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_SW_C3CC  << MSC_SW_SEL_CMOD3_SW_C3CC_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_SW_C3CV  << MSC_SW_SEL_CMOD3_SW_C3CV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_SW_C3CG  << MSC_SW_SEL_CMOD3_SW_C3CG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_REF_MODE << MSC_SW_SEL_CMOD3_REF_MODE_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD3_FLD_ENABLED  << MSC_SW_SEL_CMOD3_ENABLED_Pos)), \
        .swSelCmod4 = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_SW_C4CA << MSC_SW_SEL_CMOD4_SW_C4CA_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_SW_C4CB  << MSC_SW_SEL_CMOD4_SW_C4CB_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_SW_C4CC  << MSC_SW_SEL_CMOD4_SW_C4CC_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_SW_C4CV  << MSC_SW_SEL_CMOD4_SW_C4CV_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_SW_C4CG  << MSC_SW_SEL_CMOD4_SW_C4CG_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_REF_MODE << MSC_SW_SEL_CMOD4_REF_MODE_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_SW_SEL_CMOD4_FLD_ENABLED  << MSC_SW_SEL_CMOD4_ENABLED_Pos)), \
        .obsCtl = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_OBS_CTL_FLD_OBSERVE0 << MSC_OBS_CTL_OBSERVE0_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_OBS_CTL_FLD_OBSERVE1  << MSC_OBS_CTL_OBSERVE1_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_OBS_CTL_FLD_OBSERVE2  << MSC_OBS_CTL_OBSERVE2_Pos)  | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_OBS_CTL_FLD_OBSERVE3  << MSC_OBS_CTL_OBSERVE3_Pos)), \
        .status1            = 0x00uL, \
        .status2            = 0x00uL, \
        .status3            = 0x00uL, \
        .resultFifoStatus   = 0x00uL, \
        .resultFifoRd       = 0x00uL, \
        .intr = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_SUB_SAMPLE    << MSC_INTR_SUB_SAMPLE_Pos)     | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_SAMPLE         << MSC_INTR_SAMPLE_Pos)         | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_SCAN           << MSC_INTR_SCAN_Pos)           | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_INIT           << MSC_INTR_INIT_Pos)           | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_FRAME          << MSC_INTR_FRAME_Pos)          | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_FIFO_UNDERFLOW << MSC_INTR_FIFO_UNDERFLOW_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_FLD_FIFO_OVERFLOW  << MSC_INTR_FIFO_OVERFLOW_Pos)), \
        .intrSet = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_SUB_SAMPLE    << MSC_INTR_SET_SUB_SAMPLE_Pos)     | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_SAMPLE         << MSC_INTR_SET_SAMPLE_Pos)         | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_SCAN           << MSC_INTR_SET_SCAN_Pos)           | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_INIT           << MSC_INTR_SET_INIT_Pos)           | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_FRAME          << MSC_INTR_SET_FRAME_Pos)          | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_FIFO_UNDERFLOW << MSC_INTR_SET_FIFO_UNDERFLOW_Pos) | \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_SET_FLD_FIFO_OVERFLOW  << MSC_INTR_SET_FIFO_OVERFLOW_Pos)), \
        .intrMask = \
                    ((CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_SUB_SAMPLE        << MSC_INTR_MASK_SUB_SAMPLE_Pos)     | \
                        (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_SAMPLE         << MSC_INTR_MASK_SAMPLE_Pos)         | \
                        (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_SCAN           << MSC_INTR_MASK_SCAN_Pos)           | \
                        (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_INIT           << MSC_INTR_MASK_INIT_Pos)           | \
                        (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_FRAME          << MSC_INTR_MASK_FRAME_Pos)          | \
                        (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_FIFO_UNDERFLOW << MSC_INTR_MASK_FIFO_UNDERFLOW_Pos) | \
                        (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_INTR_MASK_FLD_FIFO_OVERFLOW  << MSC_INTR_MASK_FIFO_OVERFLOW_Pos)), \
        .intrMasked         = 0x00uL, \
        .frameCmd = \
                    (CY_CAPSENSE_SM_BASE_FULL_WAVE_REG_FRAME_CMD_FLD_START_FRAME), \
        .sensorConfig = \
        { \
            .snsSwSelCswMask2   = 0x00uL, \
            .snsSwSelCswMask1   = 0x00uL, \
            .snsSwSelCswMask0   = 0x00uL, \
            .snsScanCtl         = 0x00uL, \
            .snsCdacCtl         = 0x00uL, \
            .snsCtl             = 0x00uL, \
        }, \
        .swSelCsw = \
        { \
            [0u]       = 0x00uL, \
            [1u]       = 0x00uL, \
            [2u]       = 0x00uL, \
            [3u]       = 0x00uL, \
            [4u]       = 0x00uL, \
            [5u]       = 0x00uL, \
            [6u]       = 0x00uL, \
            [7u]       = 0x00uL, \
            [8u]       = 0x00uL, \
            [9u]       = 0x00uL, \
            [10u]      = 0x00uL, \
            [11u]      = 0x00uL, \
            [12u]      = 0x00uL, \
            [13u]      = 0x00uL, \
            [14u]      = 0x00uL, \
            [15u]      = 0x00uL, \
            [16u]      = 0x00uL, \
            [17u]      = 0x00uL, \
            [18u]      = 0x00uL, \
            [19u]      = 0x00uL, \
            [20u]      = 0x00uL, \
            [21u]      = 0x00uL, \
            [22u]      = 0x00uL, \
            [23u]      = 0x00uL, \
            [24u]      = 0x00uL, \
            [25u]      = 0x00uL, \
            [26u]      = 0x00uL, \
            [27u]      = 0x00uL, \
            [28u]      = 0x00uL, \
            [29u]      = 0x00uL, \
            [30u]      = 0x00uL, \
            [31u]      = 0x00uL, \
        }, \
        .swSelCswFunc = \
        { \
            [CY_CAPSENSE_CTRLMUX_PIN_STATE_RX] = (CY_CAPSENSE_SM_REG_SW_SEL_CSW0_RX_VALUE), \
            [CY_CAPSENSE_CTRLMUX_PIN_STATE_TX] = (CY_CAPSENSE_SM_REG_SW_SEL_CSW1_TX_VALUE), \
            [CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC4_INDEX] = CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC4_VALUE, \
            [CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS] = (CY_CAPSENSE_SM_REG_SW_SEL_CSW3_SNS_VALUE), \
            [CY_CAPSENSE_CTRLMUX_PIN_STATE_GND] = (CY_CAPSENSE_SM_REG_SW_SEL_CSW4_GND_VALUE), \
            [CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z] = (CY_CAPSENSE_SM_REG_SW_SEL_CSW5_HIGH_Z_VALUE), \
            [CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC7_INDEX] = CY_CAPSENSE_TEMPLATE_SW_SEL_CSW_FUNC7_VALUE, \
            [CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD] = (CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_CSW_VALUE), \
        }, \
        .mode = \
        { \
